## Working with CRUD operations

In [6]:
import mysql.connector

df = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "Chetan@24",
    database = "df"

)

if df.is_connected():
    print("connected to mysql")

connected to mysql

In [7]:
cursor = df.cursor()

##### Create Table

In [8]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS users (
id INT AUTO_INCREMENT PRIMARY KEY,
NAME VARCHAR(100)

)

""")

### Inserting Records

In [28]:
sql = "INSERT INTO users (name) VALUES(%s)"
values = [("sai",),("amol",),("rahul",)]
cursor.executemany(sql,values)
df.commit()
print(cursor.rowcount,"records inserted")

3 records inserted

In [29]:
cursor.execute("select * from users")

for row in cursor.fetchall():
    print(row)

(13, 'Alice')
(14, 'Bob')
(15, 'Charlie')
(16, 'sai')
(17, 'suresh')
(18, 'rahul')
(19, 'sai')
(20, 'amol')
(21, 'rahul')

#### Delete Record

In [30]:
sql = "delete from users where id =%s"
value=(12,)

cursor.execute(sql,value)

df.commit()

print(cursor.rowcount,"record(s)deleted")

0 record(s)deleted

In [31]:
cursor.execute("select * from users")

for row in cursor.fetchall():
    print(row)

(13, 'Alice')
(14, 'Bob')
(15, 'Charlie')
(16, 'sai')
(17, 'suresh')
(18, 'rahul')
(19, 'sai')
(20, 'amol')
(21, 'rahul')

#### Close Connection

In [32]:
cursor.close()
df.close()

## CURD operation on Employee Details

In [33]:
import mysql.connector

### Connect to database

In [35]:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password ="Chetan@24",
    database ="emp"

)

cursor=mydb.cursor()

### Create Employee Table

In [38]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS employee (
emp_code INT PRIMARY KEY,
name varchar(20),
age int,
salary float,
designation varchar(30)

)

""")

### Insert Record

In [42]:
insert_sql = "INSERT INTO employee(emp_code,name,age,salary,designation)VALUES(%s,%s,%s,%s,%s)"

insert_values =[
    (1,"amol",30,75500,"manager"),
     (2,"rahul",31,75000,"HR"),
     (3,"ganesh",25,55500,"Developer"),
     (4,"chetan",24,70000,"Analyst"),
     (5,"amit",32,65500,"Accountant")
]

cursor.executemany(insert_sql,insert_values)
mydb.commit()
print(cursor.rowcount,"employee records inserted")

5 employee records inserted

### Read Records

In [ ]:
# Step 4: Read records
print("\nEmployee Records:")
cursor.execute("SELECT * FROM employee")
for row in cursor.fetchall():
    print(row)

In [43]:
print("\nEmployee Records")
cursor.execute("select * from employee")
for row in cursor.fetchall():
    print(row)

Employee Records
(1, 'amol', 30, 75500.0, 'manager')
(2, 'rahul', 31, 75000.0, 'HR')
(3, 'ganesh', 25, 55500.0, 'Developer')
(4, 'chetan', 24, 70000.0, 'Analyst')
(5, 'amit', 32, 65500.0, 'Accountant')

### Update Record (salary of amit updated)

In [44]:
update_sql = "UPDATE employee SET salary = %s WHERE emp_code = %s"
cursor.execute(update_sql,(70000,5))
mydb.commit()
print("\n",cursor.rowcount,"record updated")

 1 record updated

In [45]:
print("\nEmployee Records")
cursor.execute("select * from employee")
for row in cursor.fetchall():
    print(row)

Employee Records
(1, 'amol', 30, 75500.0, 'manager')
(2, 'rahul', 31, 75000.0, 'HR')
(3, 'ganesh', 25, 55500.0, 'Developer')
(4, 'chetan', 24, 70000.0, 'Analyst')
(5, 'amit', 32, 70000.0, 'Accountant')

 ### Delete Record

In [46]:
delete_sql = "DELETE FROM employee WHERE emp_code=%s"
cursor.execute(delete_sql,(3,))
mydb.commit()
print(cursor.rowcount,"record deleted")

1 record deleted

In [47]:
print("\nEmployee Records")
cursor.execute("select * from employee")
for row in cursor.fetchall():
    print(row)

Employee Records
(1, 'amol', 30, 75500.0, 'manager')
(2, 'rahul', 31, 75000.0, 'HR')
(4, 'chetan', 24, 70000.0, 'Analyst')
(5, 'amit', 32, 70000.0, 'Accountant')

### Close Connection

In [48]:
cursor.close()
mydb.close()